7767517
2558 3038
MemoryData       0                        0 1 embd_0 0=512
MemoryData       1                        0 1 embd_1 0=512
MemoryData       2                        0 1 embd_2 0=512
MemoryData       3                        0 1 embd_3 0=512
MemoryData       4                        0 1 embd_4 0=512
MemoryData       5                        0 1 embd_5 0=512
MemoryData       6                        0 1 embd_6 0=512
MemoryData       7                        0 1 embd_7 0=512
MemoryData       8                        0 1 embd_8 0=512
MemoryData       9                        0 1 embd_9 0=512
MemoryData       10                       0 1 embd_10 0=512
MemoryData       11                       0 1 embd_11 0=512
MemoryData       12                       0 1 embd_12 0=512
MemoryData       13                       0 1 embd_13 0=512
MemoryData       14                       0 1 embd_14 0=512
MemoryData       15                       0 1 embd_15 0=512
MemoryData       16                       0 1 embd_16 0=512
MemoryData       17                       0 1 embd_17 0=512
MemoryData       18                       0 1 embd_18 0=512
MemoryData       19                       0 1 embd_19 0=512
MemoryData       20                       0 1 embd_20 0=512
MemoryData       21                       0 1 embd_21 0=512
MemoryData       22                       0 1 embd_22 0=512
MemoryData       23                       0 1 embd_23 0=512
MemoryData       24                       0 1 embd_24 0=512
MemoryData       25                       0 1 embd_25 0=512
MemoryData       26                       0 1 embd_26 0=512
MemoryData       27                       0 1 embd_27 0=512
MemoryData       28                       0 1 embd_28 0=512
MemoryData       29                       0 1 embd_29 0=512
MemoryData       30                       0 1 embd_30 0=512
MemoryData       31                       0 1 embd_31 0=512
MemoryData       32                       0 1 embd_32 0=512
MemoryData       33                       0 1 embd_33 0=512
MemoryData       34                       0 1 embd_34 0=512
MemoryData       35                       0 1 embd_35 0=512
MemoryData       36                       0 1 embd_36 0=512
MemoryData       37                       0 1 embd_37 0=512
MemoryData       38                       0 1 embd_38 0=512
MemoryData       39                       0 1 embd_39 0=512
MemoryData       40                       0 1 embd_40 0=512
MemoryData       41                       0 1 embd_41 0=512
MemoryData       42                       0 1 embd_42 0=512
MemoryData       43                       0 1 embd_43 0=512
MemoryData       44                       0 1 embd_44 0=512
MemoryData       45                       0 1 embd_45 0=512
MemoryData       46                       0 1 embd_46 0=512
MemoryData       47                       0 1 embd_47 0=512
MemoryData       48                       0 1 embd_48 0=512
MemoryData       49                       0 1 embd_49 0=512
MemoryData       50                       0 1 embd_50 0=512
MemoryData       51                       0 1 embd_51 0=512
MemoryData       52                       0 1 embd_52 0=512
MemoryData       53                       0 1 embd_53 0=512
MemoryData       54                       0 1 embd_54 0=512
MemoryData       55                       0 1 embd_55 0=512
MemoryData       56                       0 1 embd_56 0=512
MemoryData       57                       0 1 embd_57 0=512
MemoryData       58                       0 1 embd_58 0=512
MemoryData       59                       0 1 embd_59 0=512
MemoryData       60                       0 1 embd_60 0=512
MemoryData       61                       0 1 embd_61 0=512
MemoryData       62                       0 1 embd_62 0=512
MemoryData       63                       0 1 embd_63 0=512
MemoryData       64                       0 1 embd_64 0=512
MemoryData       65                       0 1 embd_65 0=512
MemoryData       66                       0 1 embd_66 0=512
MemoryData       67                       0 1 embd_67 0=512
MemoryData       68                       0 1 embd_68 0=512
MemoryData       69                       0 1 embd_69 0=512
MemoryData       70                       0 1 embd_70 0=512
MemoryData       71                       0 1 embd_71 0=512
MemoryData       72                       0 1 embd_72 0=512
MemoryData       73                       0 1 embd_73 0=512
MemoryData       74                       0 1 embd_74 0=512
MemoryData       75                       0 1 embd_75 0=512
MemoryData       76                       0 1 embd_76 0=512
MemoryData       77                       0 1 embd_77 0=512
MemoryData       78                       0 1 embd_78 0=512
MemoryData       79                       0 1 embd_79 0=512
MemoryData       80                       0 1 embd_80 0=512
MemoryData       81                       0 1 embd_81 0=512
MemoryData       82                       0 1 embd_82 0=512
MemoryData       83                       0 1 embd_83 0=512
MemoryData       84                       0 1 embd_84 0=512
MemoryData       85                       0 1 embd_85 0=512
MemoryData       86                       0 1 embd_86 0=512
MemoryData       87                       0 1 embd_87 0=512
MemoryData       88                       0 1 embd_88 0=512
MemoryData       89                       0 1 embd_89 0=512
MemoryData       90                       0 1 embd_90 0=512
MemoryData       91                       0 1 embd_91 0=512
MemoryData       92                       0 1 embd_92 0=512
MemoryData       93                       0 1 embd_93 0=512
MemoryData       94                       0 1 embd_94 0=512
MemoryData       95                       0 1 embd_95 0=512
MemoryData       96                       0 1 embd_96 0=512
MemoryData       97                       0 1 embd_97 0=512
MemoryData       98                       0 1 embd_98 0=512
MemoryData       99                       0 1 embd_99 0=512
MemoryData       100                      0 1 embd_100 0=512
MemoryData       101                      0 1 embd_101 0=512
MemoryData       102                      0 1 embd_102 0=512
MemoryData       103                      0 1 embd_103 0=512
MemoryData       104                      0 1 embd_104 0=512
MemoryData       105                      0 1 embd_105 0=512
MemoryData       106                      0 1 embd_106 0=512
MemoryData       107                      0 1 embd_107 0=512
MemoryData       108                      0 1 embd_108 0=512
MemoryData       109                      0 1 embd_109 0=512
MemoryData       110                      0 1 embd_110 0=512
MemoryData       111                      0 1 embd_111 0=512
MemoryData       112                      0 1 embd_112 0=512
MemoryData       113                      0 1 embd_113 0=512
MemoryData       114                      0 1 embd_114 0=512
MemoryData       115                      0 1 embd_115 0=512
MemoryData       116                      0 1 embd_116 0=512
MemoryData       117                      0 1 embd_117 0=512
MemoryData       118                      0 1 embd_118 0=512
MemoryData       119                      0 1 embd_119 0=512
MemoryData       120                      0 1 embd_120 0=512
MemoryData       121                      0 1 embd_121 0=512
MemoryData       122                      0 1 embd_122 0=512
MemoryData       123                      0 1 embd_123 0=512
MemoryData       124                      0 1 embd_124 0=512
MemoryData       125                      0 1 embd_125 0=512
MemoryData       126                      0 1 embd_126 0=512
MemoryData       127                      0 1 embd_127 0=512
MemoryData       128                      0 1 tensor_1702 0=512
MemoryData       129                      0 1 tensor_1705 0=64 1=64 2=8
MemoryData       130                      0 1 tensor_1708 0=512
MemoryData       131                      0 1 tensor_1711 0=512
MemoryData       132                      0 1 tensor_1714 0=64 1=64 2=8
MemoryData       133                      0 1 tensor_1717 0=512
MemoryData       134                      0 1 tensor_1720 0=512
MemoryData       135                      0 1 tensor_1723 0=64 1=64 2=8
MemoryData       136                      0 1 tensor_1726 0=512
MemoryData       137                      0 1 tensor_1729 0=512
MemoryData       138                      0 1 tensor_1732 0=64 1=64 2=8
MemoryData       139                      0 1 tensor_1735 0=512
MemoryData       140                      0 1 tensor_1738 0=512
MemoryData       141                      0 1 tensor_1741 0=64 1=64 2=8
MemoryData       142                      0 1 tensor_1744 0=512
MemoryData       143                      0 1 tensor_1747 0=512
MemoryData       144                      0 1 tensor_1750 0=64 1=64 2=8
MemoryData       145                      0 1 tensor_1753 0=512
MemoryData       146                      0 1 tensor_1756 0=512
MemoryData       147                      0 1 tensor_1759 0=64 1=64 2=8
MemoryData       148                      0 1 tensor_1762 0=512
MemoryData       149                      0 1 tensor_1765 0=512
MemoryData       150                      0 1 tensor_1768 0=64 1=64 2=8
MemoryData       151                      0 1 tensor_1771 0=512
MemoryData       152                      0 1 tensor_1774 0=512
MemoryData       153                      0 1 tensor_1777 0=64 1=64 2=8
MemoryData       154                      0 1 tensor_1780 0=512
MemoryData       155                      0 1 tensor_1783 0=512
MemoryData       156                      0 1 tensor_1786 0=64 1=64 2=8
MemoryData       157                      0 1 tensor_1789 0=512
MemoryData       158                      0 1 tensor_1792 0=512
MemoryData       159                      0 1 tensor_1795 0=64 1=64 2=8
MemoryData       160                      0 1 tensor_1798 0=512
MemoryData       161                      0 1 tensor_1801 0=512
MemoryData       162                      0 1 tensor_1804 0=64 1=64 2=8
MemoryData       163                      0 1 tensor_1807 0=512
MemoryData       164                      0 1 tensor_1810 0=512
MemoryData       165                      0 1 tensor_1813 0=64 1=64 2=8
MemoryData       166                      0 1 tensor_1816 0=512
MemoryData       167                      0 1 tensor_1819 0=512
MemoryData       168                      0 1 tensor_1822 0=64 1=64 2=8
MemoryData       169                      0 1 tensor_1825 0=512
MemoryData       170                      0 1 tensor_1828 0=512
MemoryData       171                      0 1 tensor_1831 0=64 1=64 2=8
MemoryData       172                      0 1 tensor_1834 0=512
MemoryData       173                      0 1 tensor_1837 0=512
MemoryData       174                      0 1 tensor_1840 0=64 1=64 2=8
MemoryData       175                      0 1 tensor_1843 0=512
MemoryData       176                      0 1 tensor_1846 0=512
MemoryData       177                      0 1 tensor_1849 0=64 1=64 2=8
MemoryData       178                      0 1 tensor_1852 0=512
MemoryData       179                      0 1 tensor_1855 0=512
MemoryData       180                      0 1 tensor_1858 0=64 1=64 2=8
MemoryData       181                      0 1 tensor_1861 0=512
MemoryData       182                      0 1 tensor_1864 0=512
MemoryData       183                      0 1 tensor_1867 0=64 1=64 2=8
MemoryData       184                      0 1 tensor_1870 0=512
MemoryData       185                      0 1 tensor_1873 0=512
MemoryData       186                      0 1 tensor_1876 0=64 1=64 2=8
MemoryData       187                      0 1 tensor_1879 0=512
MemoryData       188                      0 1 tensor_1882 0=512
MemoryData       189                      0 1 tensor_1885 0=64 1=64 2=8
MemoryData       190                      0 1 tensor_1888 0=512
MemoryData       191                      0 1 tensor_1891 0=512
MemoryData       192                      0 1 tensor_1894 0=64 1=64 2=8
MemoryData       193                      0 1 tensor_1897 0=512
MemoryData       194                      0 1 tensor_1900 0=512
MemoryData       195                      0 1 tensor_1903 0=64 1=64 2=8
MemoryData       196                      0 1 tensor_1906 0=512
MemoryData       197                      0 1 tensor_1909 0=512
MemoryData       198                      0 1 tensor_1912 0=64 1=64 2=8
MemoryData       199                      0 1 tensor_1915 0=512
Input            200                      0 1 input 0=512
Input            201                      0 1 state_0_0 0=512
Input            202                      0 1 state_0_1 0=64 1=64 2=8
Input            203                      0 1 state_0_2 0=512
Input            204                      0 1 state_1_0 0=512
Input            205                      0 1 state_1_1 0=64 1=64 2=8
Input            206                      0 1 state_1_2 0=512
Input            207                      0 1 state_2_0 0=512
Input            208                      0 1 state_2_1 0=64 1=64 2=8
Input            209                      0 1 state_2_2 0=512
Input            210                      0 1 state_3_0 0=512
Input            211                      0 1 state_3_1 0=64 1=64 2=8
Input            212                      0 1 state_3_2 0=512
Input            213                      0 1 state_4_0 0=512
Input            214                      0 1 state_4_1 0=64 1=64 2=8
Input            215                      0 1 state_4_2 0=512
Input            216                      0 1 state_5_0 0=512
Input            217                      0 1 state_5_1 0=64 1=64 2=8
Input            218                      0 1 state_5_2 0=512
Input            219                      0 1 state_6_0 0=512
Input            220                      0 1 state_6_1 0=64 1=64 2=8
Input            221                      0 1 state_6_2 0=512
Input            222                      0 1 state_7_0 0=512
Input            223                      0 1 state_7_1 0=64 1=64 2=8
Input            224                      0 1 state_7_2 0=512
Input            225                      0 1 state_8_0 0=512
Input            226                      0 1 state_8_1 0=64 1=64 2=8
Input            227                      0 1 state_8_2 0=512
Input            228                      0 1 state_9_0 0=512
Input            229                      0 1 state_9_1 0=64 1=64 2=8
Input            230                      0 1 state_9_2 0=512
Input            231                      0 1 state_10_0 0=512
Input            232                      0 1 state_10_1 0=64 1=64 2=8
Input            233                      0 1 state_10_2 0=512
Input            234                      0 1 state_11_0 0=512
Input            235                      0 1 state_11_1 0=64 1=64 2=8
Input            236                      0 1 state_11_2 0=512
Input            237                      0 1 state_12_0 0=512
Input            238                      0 1 state_12_1 0=64 1=64 2=8
Input            239                      0 1 state_12_2 0=512
Input            240                      0 1 state_13_0 0=512
Input            241                      0 1 state_13_1 0=64 1=64 2=8
Input            242                      0 1 state_13_2 0=512
Input            243                      0 1 state_14_0 0=512
Input            244                      0 1 state_14_1 0=64 1=64 2=8
Input            245                      0 1 state_14_2 0=512
Input            246                      0 1 state_15_0 0=512
Input            247                      0 1 state_15_1 0=64 1=64 2=8
Input            248                      0 1 state_15_2 0=512
Input            249                      0 1 state_16_0 0=512
Input            250                      0 1 state_16_1 0=64 1=64 2=8
Input            251                      0 1 state_16_2 0=512
Input            252                      0 1 state_17_0 0=512
Input            253                      0 1 state_17_1 0=64 1=64 2=8
Input            254                      0 1 state_17_2 0=512
Input            255                      0 1 state_18_0 0=512
Input            256                      0 1 state_18_1 0=64 1=64 2=8
Input            257                      0 1 state_18_2 0=512
Input            258                      0 1 state_19_0 0=512
Input            259                      0 1 state_19_1 0=64 1=64 2=8
Input            260                      0 1 state_19_2 0=512
Input            261                      0 1 state_20_0 0=512
Input            262                      0 1 state_20_1 0=64 1=64 2=8
Input            263                      0 1 state_20_2 0=512
Input            264                      0 1 state_21_0 0=512
Input            265                      0 1 state_21_1 0=64 1=64 2=8
Input            266                      0 1 state_21_2 0=512
Input            267                      0 1 state_22_0 0=512
Input            268                      0 1 state_22_1 0=64 1=64 2=8
Input            269                      0 1 state_22_2 0=512
Input            270                      0 1 state_23_0 0=512
Input            271                      0 1 state_23_1 0=64 1=64 2=8
Input            272                      0 1 state_23_2 0=512
Split            273                      1 2 input tensor_1991 tensor_1992
LayerNorm        274                      1 1 tensor_1991 tensor_1993 0=512 1=1.000000e-05 2=1
Split            275                      1 5 tensor_1993 tensor_1994 tensor_1995 tensor_1996 tensor_1997 tensor_1998
Split            276                      1 4 state_0_0 tensor_1999 tensor_2000 tensor_2001 tensor_2002
MemoryData       277                      0 1 blocks.0.att.time_mix_k 0=512
Split            278                      1 2 blocks.0.att.time_mix_k tensor_2004 tensor_2005
MemoryData       279                      0 1 blocks.0.att.time_mix_v 0=512
Split            280                      1 2 blocks.0.att.time_mix_v tensor_2007 tensor_2008
MemoryData       281                      0 1 blocks.0.att.time_mix_r 0=512
Split            282                      1 2 blocks.0.att.time_mix_r tensor_2010 tensor_2011
MemoryData       283                      0 1 blocks.0.att.time_mix_g 0=512
Split            284                      1 2 blocks.0.att.time_mix_g tensor_2013 tensor_2014
BinaryOp         285                      1 1 tensor_2005 tensor_2015 0=7 1=1 2=1.000000e+00
BinaryOp         286                      2 1 tensor_1999 tensor_2015 tensor_2016 0=2
BinaryOp         287                      2 1 tensor_1994 tensor_2004 tensor_2017 0=2
BinaryOp         288                      2 1 tensor_2017 tensor_2016 tensor_2018 0=0
BinaryOp         289                      1 1 tensor_2008 tensor_2019 0=7 1=1 2=1.000000e+00
BinaryOp         290                      2 1 tensor_2000 tensor_2019 tensor_2020 0=2
BinaryOp         291                      2 1 tensor_1995 tensor_2007 tensor_2021 0=2
BinaryOp         292                      2 1 tensor_2021 tensor_2020 tensor_2022 0=0
BinaryOp         293                      1 1 tensor_2011 tensor_2023 0=7 1=1 2=1.000000e+00
BinaryOp         294                      2 1 tensor_2001 tensor_2023 tensor_2024 0=2
BinaryOp         295                      2 1 tensor_1996 tensor_2010 tensor_2025 0=2
BinaryOp         296                      2 1 tensor_2025 tensor_2024 tensor_2026 0=0
BinaryOp         297                      1 1 tensor_2014 tensor_2027 0=7 1=1 2=1.000000e+00
BinaryOp         298                      2 1 tensor_2002 tensor_2027 tensor_2028 0=2
BinaryOp         299                      2 1 tensor_1997 tensor_2013 tensor_2029 0=2
BinaryOp         300                      2 1 tensor_2029 tensor_2028 tensor_2030 0=0
Reshape          301                      1 1 tensor_2026 tensor_2031 0=0 1=1
Gemm             302                      1 1 tensor_2031 tensor_2033 4=0 5=1 7=0 8=512 9=512
Reshape          303                      1 1 tensor_2033 tensor_2034 0=-1
Reshape          304                      1 1 tensor_2034 tensor_2035 0=64 1=1 2=8
Reshape          305                      1 1 tensor_2018 tensor_2036 0=0 1=1
Gemm             306                      1 1 tensor_2036 tensor_2038 4=0 5=1 7=0 8=512 9=512
Reshape          307                      1 1 tensor_2038 tensor_2039 0=-1
Reshape          308                      1 1 tensor_2039 tensor_2040 0=1 1=64 2=8
Reshape          309                      1 1 tensor_2022 tensor_2041 0=0 1=1
Gemm             310                      1 1 tensor_2041 tensor_2043 4=0 5=1 7=0 8=512 9=512
Reshape          311                      1 1 tensor_2043 tensor_2044 0=-1
Reshape          312                      1 1 tensor_2044 tensor_2045 0=64 1=1 2=8
Reshape          313                      1 1 tensor_2030 tensor_2046 0=0 1=1
Gemm             314                      1 1 tensor_2046 tensor_2048 4=0 5=1 7=0 8=512 9=512
Reshape          315                      1 1 tensor_2048 tensor_2049 0=-1
Swish            316                      1 1 tensor_2049 tensor_2050
MatMul           317                      2 1 tensor_2040 tensor_2045 tensor_2051 0=0
Split            318                      1 2 tensor_2051 tensor_2052 tensor_2053
Split            319                      1 2 state_0_1 tensor_2054 tensor_2055
MemoryData       320                      0 1 blocks.0.att.time_first 0=1 1=1 2=8
BinaryOp         321                      2 1 tensor_2052 blocks.0.att.time_first tensor_2057 0=2
BinaryOp         322                      2 1 tensor_2057 tensor_2054 tensor_2058 0=0
MatMul           323                      2 1 tensor_2035 tensor_2058 tensor_2059 0=0
MemoryData       324                      0 1 blocks.0.att.time_decay 0=1 1=1 2=8
BinaryOp         325                      2 1 tensor_2055 blocks.0.att.time_decay tensor_2061 0=2
BinaryOp         326                      2 1 tensor_2053 tensor_2061 tensor_2062 0=0
Reshape          327                      1 1 tensor_2059 tensor_2063 0=512
GroupNorm        328                      1 1 tensor_2063 tensor_2064 0=8 1=512 2=1.000000e-05 3=1
Reshape          329                      1 1 tensor_2064 tensor_2065 0=512
BinaryOp         330                      2 1 tensor_2065 tensor_2050 tensor_2066 0=2
Reshape          331                      1 1 tensor_2066 tensor_2067 0=0 1=1
Gemm             332                      1 1 tensor_2067 tensor_2069 4=0 5=1 7=0 8=512 9=512
Reshape          333                      1 1 tensor_2069 tensor_2070 0=-1
BinaryOp         334                      2 1 tensor_1992 tensor_2070 tensor_2071 0=0
Split            335                      1 1 tensor_1998 output_state_0_0
Split            336                      1 1 tensor_2062 output_state_0_1
Split            337                      1 2 tensor_2071 tensor_2074 tensor_2075
LayerNorm        338                      1 1 tensor_2074 tensor_2076 0=512 1=1.000000e-05 2=1
Split            339                      1 3 tensor_2076 tensor_2077 tensor_2078 tensor_2079
Split            340                      1 2 state_0_2 tensor_2080 tensor_2081
MemoryData       341                      0 1 blocks.0.ffn.time_mix_k 0=512
Split            342                      1 2 blocks.0.ffn.time_mix_k tensor_2083 tensor_2084
MemoryData       343                      0 1 blocks.0.ffn.time_mix_r 0=512
Split            344                      1 2 blocks.0.ffn.time_mix_r tensor_2086 tensor_2087
BinaryOp         345                      1 1 tensor_2084 tensor_2088 0=7 1=1 2=1.000000e+00
BinaryOp         346                      2 1 tensor_2080 tensor_2088 tensor_2089 0=2
BinaryOp         347                      2 1 tensor_2077 tensor_2083 tensor_2090 0=2
BinaryOp         348                      2 1 tensor_2090 tensor_2089 tensor_2091 0=0
BinaryOp         349                      1 1 tensor_2087 tensor_2092 0=7 1=1 2=1.000000e+00
BinaryOp         350                      2 1 tensor_2081 tensor_2092 tensor_2093 0=2
BinaryOp         351                      2 1 tensor_2078 tensor_2086 tensor_2094 0=2
BinaryOp         352                      2 1 tensor_2094 tensor_2093 tensor_2095 0=0
Reshape          353                      1 1 tensor_2095 tensor_2096 0=0 1=1
Gemm             354                      1 1 tensor_2096 tensor_2098 4=0 5=1 7=0 8=512 9=512
Reshape          355                      1 1 tensor_2098 tensor_2099 0=-1
Sigmoid          356                      1 1 tensor_2099 tensor_2100
Reshape          357                      1 1 tensor_2091 tensor_2101 0=0 1=1
Gemm             358                      1 1 tensor_2101 tensor_2103 4=0 5=1 7=0 8=1792 9=512
Reshape          359                      1 1 tensor_2103 tensor_2104 0=-1
ReLU             360                      1 1 tensor_2104 tensor_2105
BinaryOp         361                      2 1 tensor_2105 tensor_2105 tensor_2106 0=2
Reshape          362                      1 1 tensor_2106 tensor_2107 0=0 1=1
Gemm             363                      1 1 tensor_2107 tensor_2109 4=0 5=1 7=0 8=512 9=1792
Reshape          364                      1 1 tensor_2109 tensor_2110 0=-1
BinaryOp         365                      2 1 tensor_2100 tensor_2110 tensor_2111 0=2
BinaryOp         366                      2 1 tensor_2075 tensor_2111 tensor_2112 0=0
Split            367                      1 1 tensor_2079 output_state_0_2
Split            368                      1 2 tensor_2112 tensor_2114 tensor_2115
LayerNorm        369                      1 1 tensor_2114 tensor_2116 0=512 1=1.000000e-05 2=1
Split            370                      1 5 tensor_2116 tensor_2117 tensor_2118 tensor_2119 tensor_2120 tensor_2121
Split            371                      1 4 state_1_0 tensor_2122 tensor_2123 tensor_2124 tensor_2125
MemoryData       372                      0 1 blocks.1.att.time_mix_k 0=512
Split            373                      1 2 blocks.1.att.time_mix_k tensor_2127 tensor_2128
MemoryData       374                      0 1 blocks.1.att.time_mix_v 0=512
Split            375                      1 2 blocks.1.att.time_mix_v tensor_2130 tensor_2131
MemoryData       376                      0 1 blocks.1.att.time_mix_r 0=512
Split            377                      1 2 blocks.1.att.time_mix_r tensor_2133 tensor_2134
MemoryData       378                      0 1 blocks.1.att.time_mix_g 0=512
Split            379                      1 2 blocks.1.att.time_mix_g tensor_2136 tensor_2137
BinaryOp         380                      1 1 tensor_2128 tensor_2138 0=7 1=1 2=1.000000e+00
BinaryOp         381                      2 1 tensor_2122 tensor_2138 tensor_2139 0=2
BinaryOp         382                      2 1 tensor_2117 tensor_2127 tensor_2140 0=2
BinaryOp         383                      2 1 tensor_2140 tensor_2139 tensor_2141 0=0
BinaryOp         384                      1 1 tensor_2131 tensor_2142 0=7 1=1 2=1.000000e+00
BinaryOp         385                      2 1 tensor_2123 tensor_2142 tensor_2143 0=2
BinaryOp         386                      2 1 tensor_2118 tensor_2130 tensor_2144 0=2
BinaryOp         387                      2 1 tensor_2144 tensor_2143 tensor_2145 0=0
BinaryOp         388                      1 1 tensor_2134 tensor_2146 0=7 1=1 2=1.000000e+00
BinaryOp         389                      2 1 tensor_2124 tensor_2146 tensor_2147 0=2
BinaryOp         390                      2 1 tensor_2119 tensor_2133 tensor_2148 0=2
BinaryOp         391                      2 1 tensor_2148 tensor_2147 tensor_2149 0=0
BinaryOp         392                      1 1 tensor_2137 tensor_2150 0=7 1=1 2=1.000000e+00
BinaryOp         393                      2 1 tensor_2125 tensor_2150 tensor_2151 0=2
BinaryOp         394                      2 1 tensor_2120 tensor_2136 tensor_2152 0=2
BinaryOp         395                      2 1 tensor_2152 tensor_2151 tensor_2153 0=0
Reshape          396                      1 1 tensor_2149 tensor_2154 0=0 1=1
Gemm             397                      1 1 tensor_2154 tensor_2156 4=0 5=1 7=0 8=512 9=512
Reshape          398                      1 1 tensor_2156 tensor_2157 0=-1
Reshape          399                      1 1 tensor_2157 tensor_2158 0=64 1=1 2=8
Reshape          400                      1 1 tensor_2141 tensor_2159 0=0 1=1
Gemm             401                      1 1 tensor_2159 tensor_2161 4=0 5=1 7=0 8=512 9=512
Reshape          402                      1 1 tensor_2161 tensor_2162 0=-1
Reshape          403                      1 1 tensor_2162 tensor_2163 0=1 1=64 2=8
Reshape          404                      1 1 tensor_2145 tensor_2164 0=0 1=1
Gemm             405                      1 1 tensor_2164 tensor_2166 4=0 5=1 7=0 8=512 9=512
Reshape          406                      1 1 tensor_2166 tensor_2167 0=-1
Reshape          407                      1 1 tensor_2167 tensor_2168 0=64 1=1 2=8
Reshape          408                      1 1 tensor_2153 tensor_2169 0=0 1=1
Gemm             409                      1 1 tensor_2169 tensor_2171 4=0 5=1 7=0 8=512 9=512
Reshape          410                      1 1 tensor_2171 tensor_2172 0=-1
Swish            411                      1 1 tensor_2172 tensor_2173
MatMul           412                      2 1 tensor_2163 tensor_2168 tensor_2174 0=0
Split            413                      1 2 tensor_2174 tensor_2175 tensor_2176
Split            414                      1 2 state_1_1 tensor_2177 tensor_2178
MemoryData       415                      0 1 blocks.1.att.time_first 0=1 1=1 2=8
BinaryOp         416                      2 1 tensor_2175 blocks.1.att.time_first tensor_2180 0=2
BinaryOp         417                      2 1 tensor_2180 tensor_2177 tensor_2181 0=0
MatMul           418                      2 1 tensor_2158 tensor_2181 tensor_2182 0=0
MemoryData       419                      0 1 blocks.1.att.time_decay 0=1 1=1 2=8
BinaryOp         420                      2 1 tensor_2178 blocks.1.att.time_decay tensor_2184 0=2
BinaryOp         421                      2 1 tensor_2176 tensor_2184 tensor_2185 0=0
Reshape          422                      1 1 tensor_2182 tensor_2186 0=512
GroupNorm        423                      1 1 tensor_2186 tensor_2187 0=8 1=512 2=1.000000e-05 3=1
Reshape          424                      1 1 tensor_2187 tensor_2188 0=512
BinaryOp         425                      2 1 tensor_2188 tensor_2173 tensor_2189 0=2
Reshape          426                      1 1 tensor_2189 tensor_2190 0=0 1=1
Gemm             427                      1 1 tensor_2190 tensor_2192 4=0 5=1 7=0 8=512 9=512
Reshape          428                      1 1 tensor_2192 tensor_2193 0=-1
BinaryOp         429                      2 1 tensor_2115 tensor_2193 tensor_2194 0=0
Split            430                      1 1 tensor_2121 output_state_1_0
Split            431                      1 1 tensor_2185 output_state_1_1
Split            432                      1 2 tensor_2194 tensor_2197 tensor_2198
LayerNorm        433                      1 1 tensor_2197 tensor_2199 0=512 1=1.000000e-05 2=1
Split            434                      1 3 tensor_2199 tensor_2200 tensor_2201 tensor_2202
Split            435                      1 2 state_1_2 tensor_2203 tensor_2204
MemoryData       436                      0 1 blocks.1.ffn.time_mix_k 0=512
Split            437                      1 2 blocks.1.ffn.time_mix_k tensor_2206 tensor_2207
MemoryData       438                      0 1 blocks.1.ffn.time_mix_r 0=512
Split            439                      1 2 blocks.1.ffn.time_mix_r tensor_2209 tensor_2210
BinaryOp         440                      1 1 tensor_2207 tensor_2211 0=7 1=1 2=1.000000e+00
BinaryOp         441                      2 1 tensor_2203 tensor_2211 tensor_2212 0=2
BinaryOp         442                      2 1 tensor_2200 tensor_2206 tensor_2213 0=2
BinaryOp         443                      2 1 tensor_2213 tensor_2212 tensor_2214 0=0
BinaryOp         444                      1 1 tensor_2210 tensor_2215 0=7 1=1 2=1.000000e+00
BinaryOp         445                      2 1 tensor_2204 tensor_2215 tensor_2216 0=2
BinaryOp         446                      2 1 tensor_2201 tensor_2209 tensor_2217 0=2
BinaryOp         447                      2 1 tensor_2217 tensor_2216 tensor_2218 0=0
Reshape          448                      1 1 tensor_2218 tensor_2219 0=0 1=1
Gemm             449                      1 1 tensor_2219 tensor_2221 4=0 5=1 7=0 8=512 9=512
Reshape          450                      1 1 tensor_2221 tensor_2222 0=-1
Sigmoid          451                      1 1 tensor_2222 tensor_2223
Reshape          452                      1 1 tensor_2214 tensor_2224 0=0 1=1
Gemm             453                      1 1 tensor_2224 tensor_2226 4=0 5=1 7=0 8=1792 9=512
Reshape          454                      1 1 tensor_2226 tensor_2227 0=-1
ReLU             455                      1 1 tensor_2227 tensor_2228
BinaryOp         456                      2 1 tensor_2228 tensor_2228 tensor_2229 0=2
Reshape          457                      1 1 tensor_2229 tensor_2230 0=0 1=1
Gemm             458                      1 1 tensor_2230 tensor_2232 4=0 5=1 7=0 8=512 9=1792
Reshape          459                      1 1 tensor_2232 tensor_2233 0=-1
BinaryOp         460                      2 1 tensor_2223 tensor_2233 tensor_2234 0=2
BinaryOp         461                      2 1 tensor_2198 tensor_2234 tensor_2235 0=0
Split            462                      1 1 tensor_2202 output_state_1_2
Split            463                      1 2 tensor_2235 tensor_2237 tensor_2238
LayerNorm        464                      1 1 tensor_2237 tensor_2239 0=512 1=1.000000e-05 2=1
Split            465                      1 5 tensor_2239 tensor_2240 tensor_2241 tensor_2242 tensor_2243 tensor_2244
Split            466                      1 4 state_2_0 tensor_2245 tensor_2246 tensor_2247 tensor_2248
MemoryData       467                      0 1 blocks.2.att.time_mix_k 0=512
Split            468                      1 2 blocks.2.att.time_mix_k tensor_2250 tensor_2251
MemoryData       469                      0 1 blocks.2.att.time_mix_v 0=512
Split            470                      1 2 blocks.2.att.time_mix_v tensor_2253 tensor_2254
MemoryData       471                      0 1 blocks.2.att.time_mix_r 0=512
Split            472                      1 2 blocks.2.att.time_mix_r tensor_2256 tensor_2257
MemoryData       473                      0 1 blocks.2.att.time_mix_g 0=512
Split            474                      1 2 blocks.2.att.time_mix_g tensor_2259 tensor_2260
BinaryOp         475                      1 1 tensor_2251 tensor_2261 0=7 1=1 2=1.000000e+00
BinaryOp         476                      2 1 tensor_2245 tensor_2261 tensor_2262 0=2
BinaryOp         477                      2 1 tensor_2240 tensor_2250 tensor_2263 0=2
BinaryOp         478                      2 1 tensor_2263 tensor_2262 tensor_2264 0=0
BinaryOp         479                      1 1 tensor_2254 tensor_2265 0=7 1=1 2=1.000000e+00
BinaryOp         480                      2 1 tensor_2246 tensor_2265 tensor_2266 0=2
BinaryOp         481                      2 1 tensor_2241 tensor_2253 tensor_2267 0=2
BinaryOp         482                      2 1 tensor_2267 tensor_2266 tensor_2268 0=0
BinaryOp         483                      1 1 tensor_2257 tensor_2269 0=7 1=1 2=1.000000e+00
BinaryOp         484                      2 1 tensor_2247 tensor_2269 tensor_2270 0=2
BinaryOp         485                      2 1 tensor_2242 tensor_2256 tensor_2271 0=2
BinaryOp         486                      2 1 tensor_2271 tensor_2270 tensor_2272 0=0
BinaryOp         487                      1 1 tensor_2260 tensor_2273 0=7 1=1 2=1.000000e+00
BinaryOp         488                      2 1 tensor_2248 tensor_2273 tensor_2274 0=2
BinaryOp         489                      2 1 tensor_2243 tensor_2259 tensor_2275 0=2
BinaryOp         490                      2 1 tensor_2275 tensor_2274 tensor_2276 0=0
Reshape          491                      1 1 tensor_2272 tensor_2277 0=0 1=1
Gemm             492                      1 1 tensor_2277 tensor_2279 4=0 5=1 7=0 8=512 9=512
Reshape          493                      1 1 tensor_2279 tensor_2280 0=-1
Reshape          494                      1 1 tensor_2280 tensor_2281 0=64 1=1 2=8
Reshape          495                      1 1 tensor_2264 tensor_2282 0=0 1=1
Gemm             496                      1 1 tensor_2282 tensor_2284 4=0 5=1 7=0 8=512 9=512
Reshape          497                      1 1 tensor_2284 tensor_2285 0=-1
Reshape          498                      1 1 tensor_2285 tensor_2286 0=1 1=64 2=8
Reshape          499                      1 1 tensor_2268 tensor_2287 0=0 1=1
Gemm             500                      1 1 tensor_2287 tensor_2289 4=0 5=1 7=0 8=512 9=512
Reshape          501                      1 1 tensor_2289 tensor_2290 0=-1
Reshape          502                      1 1 tensor_2290 tensor_2291 0=64 1=1 2=8
Reshape          503                      1 1 tensor_2276 tensor_2292 0=0 1=1
Gemm             504                      1 1 tensor_2292 tensor_2294 4=0 5=1 7=0 8=512 9=512
Reshape          505                      1 1 tensor_2294 tensor_2295 0=-1
Swish            506                      1 1 tensor_2295 tensor_2296
MatMul           507                      2 1 tensor_2286 tensor_2291 tensor_2297 0=0
Split            508                      1 2 tensor_2297 tensor_2298 tensor_2299
Split            509                      1 2 state_2_1 tensor_2300 tensor_2301
MemoryData       510                      0 1 blocks.2.att.time_first 0=1 1=1 2=8
BinaryOp         511                      2 1 tensor_2298 blocks.2.att.time_first tensor_2303 0=2
BinaryOp         512                      2 1 tensor_2303 tensor_2300 tensor_2304 0=0
MatMul           513                      2 1 tensor_2281 tensor_2304 tensor_2305 0=0
MemoryData       514                      0 1 blocks.2.att.time_decay 0=1 1=1 2=8
BinaryOp         515                      2 1 tensor_2301 blocks.2.att.time_decay tensor_2307 0=2
BinaryOp         516                      2 1 tensor_2299 tensor_2307 tensor_2308 0=0
Reshape          517                      1 1 tensor_2305 tensor_2309 0=512
GroupNorm        518                      1 1 tensor_2309 tensor_2310 0=8 1=512 2=1.000000e-05 3=1
Reshape          519                      1 1 tensor_2310 tensor_2311 0=512
BinaryOp         520                      2 1 tensor_2311 tensor_2296 tensor_2312 0=2
Reshape          521                      1 1 tensor_2312 tensor_2313 0=0 1=1
Gemm             522                      1 1 tensor_2313 tensor_2315 4=0 5=1 7=0 8=512 9=512
Reshape          523                      1 1 tensor_2315 tensor_2316 0=-1
BinaryOp         524                      2 1 tensor_2238 tensor_2316 tensor_2317 0=0
Split            525                      1 1 tensor_2244 output_state_2_0
Split            526                      1 1 tensor_2308 output_state_2_1
Split            527                      1 2 tensor_2317 tensor_2320 tensor_2321
LayerNorm        528                      1 1 tensor_2320 tensor_2322 0=512 1=1.000000e-05 2=1
Split            529                      1 3 tensor_2322 tensor_2323 tensor_2324 tensor_2325
Split            530                      1 2 state_2_2 tensor_2326 tensor_2327
MemoryData       531                      0 1 blocks.2.ffn.time_mix_k 0=512
Split            532                      1 2 blocks.2.ffn.time_mix_k tensor_2329 tensor_2330
MemoryData       533                      0 1 blocks.2.ffn.time_mix_r 0=512
Split            534                      1 2 blocks.2.ffn.time_mix_r tensor_2332 tensor_2333
BinaryOp         535                      1 1 tensor_2330 tensor_2334 0=7 1=1 2=1.000000e+00
BinaryOp         536                      2 1 tensor_2326 tensor_2334 tensor_2335 0=2
BinaryOp         537                      2 1 tensor_2323 tensor_2329 tensor_2336 0=2
BinaryOp         538                      2 1 tensor_2336 tensor_2335 tensor_2337 0=0
BinaryOp         539                      1 1 tensor_2333 tensor_2338 0=7 1=1 2=1.000000e+00
BinaryOp         540                      2 1 tensor_2327 tensor_2338 tensor_2339 0=2
BinaryOp         541                      2 1 tensor_2324 tensor_2332 tensor_2340 0=2
BinaryOp         542                      2 1 tensor_2340 tensor_2339 tensor_2341 0=0
Reshape          543                      1 1 tensor_2341 tensor_2342 0=0 1=1
Gemm             544                      1 1 tensor_2342 tensor_2344 4=0 5=1 7=0 8=512 9=512
Reshape          545                      1 1 tensor_2344 tensor_2345 0=-1
Sigmoid          546                      1 1 tensor_2345 tensor_2346
Reshape          547                      1 1 tensor_2337 tensor_2347 0=0 1=1
Gemm             548                      1 1 tensor_2347 tensor_2349 4=0 5=1 7=0 8=1792 9=512
Reshape          549                      1 1 tensor_2349 tensor_2350 0=-1
ReLU             550                      1 1 tensor_2350 tensor_2351
BinaryOp         551                      2 1 tensor_2351 tensor_2351 tensor_2352 0=2
Reshape          552                      1 1 tensor_2352 tensor_2353 0=0 1=1
Gemm             553                      1 1 tensor_2353 tensor_2355 4=0 5=1 7=0 8=512 9=1792
Reshape          554                      1 1 tensor_2355 tensor_2356 0=-1
BinaryOp         555                      2 1 tensor_2346 tensor_2356 tensor_2357 0=2
BinaryOp         556                      2 1 tensor_2321 tensor_2357 tensor_2358 0=0
Split            557                      1 1 tensor_2325 output_state_2_2
Split            558                      1 2 tensor_2358 tensor_2360 tensor_2361
LayerNorm        559                      1 1 tensor_2360 tensor_2362 0=512 1=1.000000e-05 2=1
Split            560                      1 5 tensor_2362 tensor_2363 tensor_2364 tensor_2365 tensor_2366 tensor_2367
Split            561                      1 4 state_3_0 tensor_2368 tensor_2369 tensor_2370 tensor_2371
MemoryData       562                      0 1 blocks.3.att.time_mix_k 0=512
Split            563                      1 2 blocks.3.att.time_mix_k tensor_2373 tensor_2374
MemoryData       564                      0 1 blocks.3.att.time_mix_v 0=512
Split            565                      1 2 blocks.3.att.time_mix_v tensor_2376 tensor_2377
MemoryData       566                      0 1 blocks.3.att.time_mix_r 0=512
Split            567                      1 2 blocks.3.att.time_mix_r tensor_2379 tensor_2380
MemoryData       568                      0 1 blocks.3.att.time_mix_g 0=512
Split            569                      1 2 blocks.3.att.time_mix_g tensor_2382 tensor_2383
BinaryOp         570                      1 1 tensor_2374 tensor_2384 0=7 1=1 2=1.000000e+00
BinaryOp         571                      2 1 tensor_2368 tensor_2384 tensor_2385 0=2
BinaryOp         572                      2 1 tensor_2363 tensor_2373 tensor_2386 0=2
BinaryOp         573                      2 1 tensor_2386 tensor_2385 tensor_2387 0=0
BinaryOp         574                      1 1 tensor_2377 tensor_2388 0=7 1=1 2=1.000000e+00
BinaryOp         575                      2 1 tensor_2369 tensor_2388 tensor_2389 0=2
BinaryOp         576                      2 1 tensor_2364 tensor_2376 tensor_2390 0=2
BinaryOp         577                      2 1 tensor_2390 tensor_2389 tensor_2391 0=0
BinaryOp         578                      1 1 tensor_2380 tensor_2392 0=7 1=1 2=1.000000e+00
BinaryOp         579                      2 1 tensor_2370 tensor_2392 tensor_2393 0=2
BinaryOp         580                      2 1 tensor_2365 tensor_2379 tensor_2394 0=2
BinaryOp         581                      2 1 tensor_2394 tensor_2393 tensor_2395 0=0
BinaryOp         582                      1 1 tensor_2383 tensor_2396 0=7 1=1 2=1.000000e+00
BinaryOp         583                      2 1 tensor_2371 tensor_2396 tensor_2397 0=2
BinaryOp         584                      2 1 tensor_2366 tensor_2382 tensor_2398 0=2
BinaryOp         585                      2 1 tensor_2398 tensor_2397 tensor_2399 0=0
Reshape          586                      1 1 tensor_2395 tensor_2400 0=0 1=1
Gemm             587                      1 1 tensor_2400 tensor_2402 4=0 5=1 7=0 8=512 9=512
Reshape          588                      1 1 tensor_2402 tensor_2403 0=-1
Reshape          589                      1 1 tensor_2403 tensor_2404 0=64 1=1 2=8
Reshape          590                      1 1 tensor_2387 tensor_2405 0=0 1=1
Gemm             591                      1 1 tensor_2405 tensor_2407 4=0 5=1 7=0 8=512 9=512
Reshape          592                      1 1 tensor_2407 tensor_2408 0=-1
Reshape          593                      1 1 tensor_2408 tensor_2409 0=1 1=64 2=8
Reshape          594                      1 1 tensor_2391 tensor_2410 0=0 1=1
Gemm             595                      1 1 tensor_2410 tensor_2412 4=0 5=1 7=0 8=512 9=512
Reshape          596                      1 1 tensor_2412 tensor_2413 0=-1
Reshape          597                      1 1 tensor_2413 tensor_2414 0=64 1=1 2=8
Reshape          598                      1 1 tensor_2399 tensor_2415 0=0 1=1
Gemm             599                      1 1 tensor_2415 tensor_2417 4=0 5=1 7=0 8=512 9=512
Reshape          600                      1 1 tensor_2417 tensor_2418 0=-1
Swish            601                      1 1 tensor_2418 tensor_2419
MatMul           602                      2 1 tensor_2409 tensor_2414 tensor_2420 0=0
Split            603                      1 2 tensor_2420 tensor_2421 tensor_2422
Split            604                      1 2 state_3_1 tensor_2423 tensor_2424
MemoryData       605                      0 1 blocks.3.att.time_first 0=1 1=1 2=8
BinaryOp         606                      2 1 tensor_2421 blocks.3.att.time_first tensor_2426 0=2
BinaryOp         607                      2 1 tensor_2426 tensor_2423 tensor_2427 0=0
MatMul           608                      2 1 tensor_2404 tensor_2427 tensor_2428 0=0
MemoryData       609                      0 1 blocks.3.att.time_decay 0=1 1=1 2=8
BinaryOp         610                      2 1 tensor_2424 blocks.3.att.time_decay tensor_2430 0=2
BinaryOp         611                      2 1 tensor_2422 tensor_2430 tensor_2431 0=0
Reshape          612                      1 1 tensor_2428 tensor_2432 0=512
GroupNorm        613                      1 1 tensor_2432 tensor_2433 0=8 1=512 2=1.000000e-05 3=1
Reshape          614                      1 1 tensor_2433 tensor_2434 0=512
BinaryOp         615                      2 1 tensor_2434 tensor_2419 tensor_2435 0=2
Reshape          616                      1 1 tensor_2435 tensor_2436 0=0 1=1
Gemm             617                      1 1 tensor_2436 tensor_2438 4=0 5=1 7=0 8=512 9=512
Reshape          618                      1 1 tensor_2438 tensor_2439 0=-1
BinaryOp         619                      2 1 tensor_2361 tensor_2439 tensor_2440 0=0
Split            620                      1 1 tensor_2367 output_state_3_0
Split            621                      1 1 tensor_2431 output_state_3_1
Split            622                      1 2 tensor_2440 tensor_2443 tensor_2444
LayerNorm        623                      1 1 tensor_2443 tensor_2445 0=512 1=1.000000e-05 2=1
Split            624                      1 3 tensor_2445 tensor_2446 tensor_2447 tensor_2448
Split            625                      1 2 state_3_2 tensor_2449 tensor_2450
MemoryData       626                      0 1 blocks.3.ffn.time_mix_k 0=512
Split            627                      1 2 blocks.3.ffn.time_mix_k tensor_2452 tensor_2453
MemoryData       628                      0 1 blocks.3.ffn.time_mix_r 0=512
Split            629                      1 2 blocks.3.ffn.time_mix_r tensor_2455 tensor_2456
BinaryOp         630                      1 1 tensor_2453 tensor_2457 0=7 1=1 2=1.000000e+00
BinaryOp         631                      2 1 tensor_2449 tensor_2457 tensor_2458 0=2
BinaryOp         632                      2 1 tensor_2446 tensor_2452 tensor_2459 0=2
BinaryOp         633                      2 1 tensor_2459 tensor_2458 tensor_2460 0=0
BinaryOp         634                      1 1 tensor_2456 tensor_2461 0=7 1=1 2=1.000000e+00
BinaryOp         635                      2 1 tensor_2450 tensor_2461 tensor_2462 0=2
BinaryOp         636                      2 1 tensor_2447 tensor_2455 tensor_2463 0=2
BinaryOp         637                      2 1 tensor_2463 tensor_2462 tensor_2464 0=0
Reshape          638                      1 1 tensor_2464 tensor_2465 0=0 1=1
Gemm             639                      1 1 tensor_2465 tensor_2467 4=0 5=1 7=0 8=512 9=512
Reshape          640                      1 1 tensor_2467 tensor_2468 0=-1
Sigmoid          641                      1 1 tensor_2468 tensor_2469
Reshape          642                      1 1 tensor_2460 tensor_2470 0=0 1=1
Gemm             643                      1 1 tensor_2470 tensor_2472 4=0 5=1 7=0 8=1792 9=512
Reshape          644                      1 1 tensor_2472 tensor_2473 0=-1
ReLU             645                      1 1 tensor_2473 tensor_2474
BinaryOp         646                      2 1 tensor_2474 tensor_2474 tensor_2475 0=2
Reshape          647                      1 1 tensor_2475 tensor_2476 0=0 1=1
Gemm             648                      1 1 tensor_2476 tensor_2478 4=0 5=1 7=0 8=512 9=1792
Reshape          649                      1 1 tensor_2478 tensor_2479 0=-1
BinaryOp         650                      2 1 tensor_2469 tensor_2479 tensor_2480 0=2
BinaryOp         651                      2 1 tensor_2444 tensor_2480 tensor_2481 0=0
Split            652                      1 1 tensor_2448 output_state_3_2
Split            653                      1 2 tensor_2481 tensor_2483 tensor_2484
LayerNorm        654                      1 1 tensor_2483 tensor_2485 0=512 1=1.000000e-05 2=1
Split            655                      1 5 tensor_2485 tensor_2486 tensor_2487 tensor_2488 tensor_2489 tensor_2490
