7767517
2936 3512
MemoryData       0                        0 1 tensor_2409 0=512 21=0
MemoryData       1                        0 1 tensor_2412 0=64 1=64 2=8 21=0
MemoryData       2                        0 1 tensor_2415 0=512 21=0
MemoryData       3                        0 1 tensor_2418 0=512 21=0
MemoryData       4                        0 1 tensor_2421 0=64 1=64 2=8 21=0
MemoryData       5                        0 1 tensor_2424 0=512 21=0
MemoryData       6                        0 1 tensor_2427 0=512 21=0
MemoryData       7                        0 1 tensor_2430 0=64 1=64 2=8 21=0
MemoryData       8                        0 1 tensor_2433 0=512 21=0
MemoryData       9                        0 1 tensor_2436 0=512 21=0
MemoryData       10                       0 1 tensor_2439 0=64 1=64 2=8 21=0
MemoryData       11                       0 1 tensor_2442 0=512 21=0
MemoryData       12                       0 1 tensor_2445 0=512 21=0
MemoryData       13                       0 1 tensor_2448 0=64 1=64 2=8 21=0
MemoryData       14                       0 1 tensor_2451 0=512 21=0
MemoryData       15                       0 1 tensor_2454 0=512 21=0
MemoryData       16                       0 1 tensor_2457 0=64 1=64 2=8 21=0
MemoryData       17                       0 1 tensor_2460 0=512 21=0
MemoryData       18                       0 1 tensor_2463 0=512 21=0
MemoryData       19                       0 1 tensor_2466 0=64 1=64 2=8 21=0
MemoryData       20                       0 1 tensor_2469 0=512 21=0
MemoryData       21                       0 1 tensor_2472 0=512 21=0
MemoryData       22                       0 1 tensor_2475 0=64 1=64 2=8 21=0
MemoryData       23                       0 1 tensor_2478 0=512 21=0
MemoryData       24                       0 1 tensor_2481 0=512 21=0
MemoryData       25                       0 1 tensor_2484 0=64 1=64 2=8 21=0
MemoryData       26                       0 1 tensor_2487 0=512 21=0
MemoryData       27                       0 1 tensor_2490 0=512 21=0
MemoryData       28                       0 1 tensor_2493 0=64 1=64 2=8 21=0
MemoryData       29                       0 1 tensor_2496 0=512 21=0
MemoryData       30                       0 1 tensor_2499 0=512 21=0
MemoryData       31                       0 1 tensor_2502 0=64 1=64 2=8 21=0
MemoryData       32                       0 1 tensor_2505 0=512 21=0
MemoryData       33                       0 1 tensor_2508 0=512 21=0
MemoryData       34                       0 1 tensor_2511 0=64 1=64 2=8 21=0
MemoryData       35                       0 1 tensor_2514 0=512 21=0
MemoryData       36                       0 1 tensor_2517 0=512 21=0
MemoryData       37                       0 1 tensor_2520 0=64 1=64 2=8 21=0
MemoryData       38                       0 1 tensor_2523 0=512 21=0
MemoryData       39                       0 1 tensor_2526 0=512 21=0
MemoryData       40                       0 1 tensor_2529 0=64 1=64 2=8 21=0
MemoryData       41                       0 1 tensor_2532 0=512 21=0
MemoryData       42                       0 1 tensor_2535 0=512 21=0
MemoryData       43                       0 1 tensor_2538 0=64 1=64 2=8 21=0
MemoryData       44                       0 1 tensor_2541 0=512 21=0
MemoryData       45                       0 1 tensor_2544 0=512 21=0
MemoryData       46                       0 1 tensor_2547 0=64 1=64 2=8 21=0
MemoryData       47                       0 1 tensor_2550 0=512 21=0
MemoryData       48                       0 1 tensor_2553 0=512 21=0
MemoryData       49                       0 1 tensor_2556 0=64 1=64 2=8 21=0
MemoryData       50                       0 1 tensor_2559 0=512 21=0
MemoryData       51                       0 1 tensor_2562 0=512 21=0
MemoryData       52                       0 1 tensor_2565 0=64 1=64 2=8 21=0
MemoryData       53                       0 1 tensor_2568 0=512 21=0
MemoryData       54                       0 1 tensor_2571 0=512 21=0
MemoryData       55                       0 1 tensor_2574 0=64 1=64 2=8 21=0
MemoryData       56                       0 1 tensor_2577 0=512 21=0
MemoryData       57                       0 1 tensor_2580 0=512 21=0
MemoryData       58                       0 1 tensor_2583 0=64 1=64 2=8 21=0
MemoryData       59                       0 1 tensor_2586 0=512 21=0
MemoryData       60                       0 1 tensor_2589 0=512 21=0
MemoryData       61                       0 1 tensor_2592 0=64 1=64 2=8 21=0
MemoryData       62                       0 1 tensor_2595 0=512 21=0
MemoryData       63                       0 1 tensor_2598 0=512 21=0
MemoryData       64                       0 1 tensor_2601 0=64 1=64 2=8 21=0
MemoryData       65                       0 1 tensor_2604 0=512 21=0
MemoryData       66                       0 1 tensor_2607 0=512 21=0
MemoryData       67                       0 1 tensor_2610 0=64 1=64 2=8 21=0
MemoryData       68                       0 1 tensor_2613 0=512 21=0
MemoryData       69                       0 1 tensor_2616 0=512 21=0
MemoryData       70                       0 1 tensor_2619 0=64 1=64 2=8 21=0
MemoryData       71                       0 1 tensor_2622 0=512 21=0
Input            72                       0 1 input_id 0=1
Input            73                       0 1 state_0_0 0=512
Input            74                       0 1 state_0_1 0=64 1=64 2=8
Input            75                       0 1 state_0_2 0=512
Input            76                       0 1 state_1_0 0=512
Input            77                       0 1 state_1_1 0=64 1=64 2=8
Input            78                       0 1 state_1_2 0=512
Input            79                       0 1 state_2_0 0=512
Input            80                       0 1 state_2_1 0=64 1=64 2=8
Input            81                       0 1 state_2_2 0=512
Input            82                       0 1 state_3_0 0=512
Input            83                       0 1 state_3_1 0=64 1=64 2=8
Input            84                       0 1 state_3_2 0=512
Input            85                       0 1 state_4_0 0=512
Input            86                       0 1 state_4_1 0=64 1=64 2=8
Input            87                       0 1 state_4_2 0=512
Input            88                       0 1 state_5_0 0=512
Input            89                       0 1 state_5_1 0=64 1=64 2=8
Input            90                       0 1 state_5_2 0=512
Input            91                       0 1 state_6_0 0=512
Input            92                       0 1 state_6_1 0=64 1=64 2=8
Input            93                       0 1 state_6_2 0=512
Input            94                       0 1 state_7_0 0=512
Input            95                       0 1 state_7_1 0=64 1=64 2=8
Input            96                       0 1 state_7_2 0=512
Input            97                       0 1 state_8_0 0=512
Input            98                       0 1 state_8_1 0=64 1=64 2=8
Input            99                       0 1 state_8_2 0=512
Input            100                      0 1 state_9_0 0=512
Input            101                      0 1 state_9_1 0=64 1=64 2=8
Input            102                      0 1 state_9_2 0=512
Input            103                      0 1 state_10_0 0=512
Input            104                      0 1 state_10_1 0=64 1=64 2=8
Input            105                      0 1 state_10_2 0=512
Input            106                      0 1 state_11_0 0=512
Input            107                      0 1 state_11_1 0=64 1=64 2=8
Input            108                      0 1 state_11_2 0=512
Input            109                      0 1 state_12_0 0=512
Input            110                      0 1 state_12_1 0=64 1=64 2=8
Input            111                      0 1 state_12_2 0=512
Input            112                      0 1 state_13_0 0=512
Input            113                      0 1 state_13_1 0=64 1=64 2=8
Input            114                      0 1 state_13_2 0=512
Input            115                      0 1 state_14_0 0=512
Input            116                      0 1 state_14_1 0=64 1=64 2=8
Input            117                      0 1 state_14_2 0=512
Input            118                      0 1 state_15_0 0=512
Input            119                      0 1 state_15_1 0=64 1=64 2=8
Input            120                      0 1 state_15_2 0=512
Input            121                      0 1 state_16_0 0=512
Input            122                      0 1 state_16_1 0=64 1=64 2=8
Input            123                      0 1 state_16_2 0=512
Input            124                      0 1 state_17_0 0=512
Input            125                      0 1 state_17_1 0=64 1=64 2=8
Input            126                      0 1 state_17_2 0=512
Input            127                      0 1 state_18_0 0=512
Input            128                      0 1 state_18_1 0=64 1=64 2=8
Input            129                      0 1 state_18_2 0=512
Input            130                      0 1 state_19_0 0=512
Input            131                      0 1 state_19_1 0=64 1=64 2=8
Input            132                      0 1 state_19_2 0=512
Input            133                      0 1 state_20_0 0=512
Input            134                      0 1 state_20_1 0=64 1=64 2=8
Input            135                      0 1 state_20_2 0=512
Input            136                      0 1 state_21_0 0=512
Input            137                      0 1 state_21_1 0=64 1=64 2=8
Input            138                      0 1 state_21_2 0=512
Input            139                      0 1 state_22_0 0=512
Input            140                      0 1 state_22_1 0=64 1=64 2=8
Input            141                      0 1 state_22_2 0=512
Input            142                      0 1 state_23_0 0=512
Input            143                      0 1 state_23_1 0=64 1=64 2=8
Input            144                      0 1 state_23_2 0=512
Embed            145                      1 1 input_id tensor_2699 0=512 1=128 3=65536 4=64
Reshape          146                      1 1 tensor_2699 tensor_2702 0=512
Split            147                      1 2 tensor_2702 tensor_2703 tensor_2704
LayerNorm        148                      1 1 tensor_2703 tensor_2705 0=512 1=1.000000e-05 2=1
Split            149                      1 3 tensor_2705 tensor_2706 tensor_2707 tensor_2708
Split            150                      1 6 tensor_2706 tensor_2709 tensor_2710 tensor_2711 tensor_2712 tensor_2713 tensor_2714
BinaryOp         151                      2 1 state_0_0 tensor_2707 tensor_2715 0=1
Split            152                      1 6 tensor_2715 tensor_2716 tensor_2717 tensor_2718 tensor_2719 tensor_2720 tensor_2721
MemoryData       153                      0 1 blocks.0.att.time_mix_x 0=512 21=0
BinaryOp         154                      2 1 tensor_2716 blocks.0.att.time_mix_x tensor_2723 0=2
BinaryOp         155                      2 1 tensor_2708 tensor_2723 tensor_2724 0=0
MemoryData       156                      0 1 blocks.0.att.time_mix_w1 0=160 1=512 21=0
MatMul           157                      2 1 tensor_2724 blocks.0.att.time_mix_w1 tensor_2726 0=0
TanH             158                      1 1 tensor_2726 tensor_2727
Reshape          159                      1 1 tensor_2727 tensor_2728 0=32 1=1 2=5
MemoryData       160                      0 1 blocks.0.att.time_mix_w2 0=512 1=32 2=5 21=0
MatMul           161                      2 1 tensor_2728 blocks.0.att.time_mix_w2 tensor_2730 0=0
Reshape          162                      1 1 tensor_2730 tensor_2731 0=512 1=5
Slice            163                      1 5 tensor_2731 tensor_2732 tensor_2733 tensor_2734 tensor_2735 tensor_2736 -23300=5,-233,-233,-233,-233,-233 1=0
Reshape          164                      1 1 tensor_2732 tensor_2737 0=512
MemoryData       165                      0 1 blocks.0.att.time_mix_w 0=512 21=0
BinaryOp         166                      2 1 blocks.0.att.time_mix_w tensor_2737 tensor_2739 0=0
BinaryOp         167                      2 1 tensor_2717 tensor_2739 tensor_2740 0=2
BinaryOp         168                      2 1 tensor_2709 tensor_2740 tensor_2741 0=0
Reshape          169                      1 1 tensor_2733 tensor_2742 0=512
MemoryData       170                      0 1 blocks.0.att.time_mix_k 0=512 21=0
BinaryOp         171                      2 1 blocks.0.att.time_mix_k tensor_2742 tensor_2744 0=0
BinaryOp         172                      2 1 tensor_2718 tensor_2744 tensor_2745 0=2
BinaryOp         173                      2 1 tensor_2710 tensor_2745 tensor_2746 0=0
Reshape          174                      1 1 tensor_2734 tensor_2747 0=512
MemoryData       175                      0 1 blocks.0.att.time_mix_v 0=512 21=0
BinaryOp         176                      2 1 blocks.0.att.time_mix_v tensor_2747 tensor_2749 0=0
BinaryOp         177                      2 1 tensor_2719 tensor_2749 tensor_2750 0=2
BinaryOp         178                      2 1 tensor_2711 tensor_2750 tensor_2751 0=0
Reshape          179                      1 1 tensor_2735 tensor_2752 0=512
MemoryData       180                      0 1 blocks.0.att.time_mix_r 0=512 21=0
BinaryOp         181                      2 1 blocks.0.att.time_mix_r tensor_2752 tensor_2754 0=0
BinaryOp         182                      2 1 tensor_2720 tensor_2754 tensor_2755 0=2
BinaryOp         183                      2 1 tensor_2712 tensor_2755 tensor_2756 0=0
Reshape          184                      1 1 tensor_2736 tensor_2757 0=512
MemoryData       185                      0 1 blocks.0.att.time_mix_g 0=512 21=0
BinaryOp         186                      2 1 blocks.0.att.time_mix_g tensor_2757 tensor_2759 0=0
BinaryOp         187                      2 1 tensor_2721 tensor_2759 tensor_2760 0=2
BinaryOp         188                      2 1 tensor_2713 tensor_2760 tensor_2761 0=0
Reshape          189                      1 1 tensor_2741 tensor_2762 0=0 1=1
Gemm             190                      1 1 tensor_2762 tensor_2764 4=0 5=1 6=1 7=0 8=64 9=512 10=-1
Reshape          191                      1 1 tensor_2764 tensor_2765 0=-1
TanH             192                      1 1 tensor_2765 tensor_2766
Reshape          193                      1 1 tensor_2766 tensor_2767 0=0 1=1
Gemm             194                      1 1 tensor_2767 tensor_2769 4=0 5=1 6=1 7=0 8=512 9=64 10=-1
Reshape          195                      1 1 tensor_2769 tensor_2770 0=-1
Reshape          196                      1 1 tensor_2770 tensor_2771 0=1 1=64 2=8
MemoryData       197                      0 1 blocks.0.att.time_decay 0=1 1=64 2=8 21=0
BinaryOp         198                      2 1 blocks.0.att.time_decay tensor_2771 tensor_2773 0=0
Exp              199                      1 1 tensor_2773 tensor_2774
BinaryOp         200                      1 1 tensor_2774 tensor_2775 0=7 1=1 2=0.000000e+00
Exp              201                      1 1 tensor_2775 tensor_2776
Reshape          202                      1 1 tensor_2756 tensor_2777 0=0 1=1
Gemm             203                      1 1 tensor_2777 tensor_2779 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          204                      1 1 tensor_2779 tensor_2780 0=-1
Reshape          205                      1 1 tensor_2780 tensor_2781 0=64 1=1 2=8
Reshape          206                      1 1 tensor_2746 tensor_2782 0=0 1=1
Gemm             207                      1 1 tensor_2782 tensor_2784 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          208                      1 1 tensor_2784 tensor_2785 0=-1
Reshape          209                      1 1 tensor_2785 tensor_2786 0=1 1=64 2=8
Reshape          210                      1 1 tensor_2751 tensor_2787 0=0 1=1
Gemm             211                      1 1 tensor_2787 tensor_2789 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          212                      1 1 tensor_2789 tensor_2790 0=-1
Reshape          213                      1 1 tensor_2790 tensor_2791 0=64 1=1 2=8
Reshape          214                      1 1 tensor_2761 tensor_2792 0=0 1=1
Gemm             215                      1 1 tensor_2792 tensor_2794 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          216                      1 1 tensor_2794 tensor_2795 0=-1
Swish            217                      1 1 tensor_2795 tensor_2796
MatMul           218                      2 1 tensor_2786 tensor_2791 tensor_2797 0=0
Split            219                      1 2 tensor_2797 tensor_2798 tensor_2799
Split            220                      1 2 state_0_1 tensor_2800 tensor_2801
MemoryData       221                      0 1 blocks.0.att.time_first 0=1 1=64 2=8 21=0
BinaryOp         222                      2 1 tensor_2798 blocks.0.att.time_first tensor_2803 0=2
BinaryOp         223                      2 1 tensor_2803 tensor_2800 tensor_2804 0=0
MatMul           224                      2 1 tensor_2781 tensor_2804 tensor_2805 0=0
BinaryOp         225                      2 1 tensor_2801 tensor_2776 tensor_2806 0=2
BinaryOp         226                      2 1 tensor_2799 tensor_2806 tensor_2807 0=0
Reshape          227                      1 1 tensor_2805 tensor_2808 0=512
GroupNorm        228                      1 1 tensor_2808 tensor_2809 0=8 1=512 2=1.000000e-05 3=1
Reshape          229                      1 1 tensor_2809 tensor_2810 0=512
BinaryOp         230                      2 1 tensor_2810 tensor_2796 tensor_2811 0=2
Reshape          231                      1 1 tensor_2811 tensor_2812 0=0 1=1
Gemm             232                      1 1 tensor_2812 tensor_2814 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          233                      1 1 tensor_2814 tensor_2815 0=-1
BinaryOp         234                      2 1 tensor_2704 tensor_2815 tensor_2816 0=0
Split            235                      1 1 tensor_2714 output_state_0_0
Split            236                      1 1 tensor_2807 output_state_0_1
Split            237                      1 2 tensor_2816 tensor_2819 tensor_2820
LayerNorm        238                      1 1 tensor_2819 tensor_2821 0=512 1=1.000000e-05 2=1
Split            239                      1 4 tensor_2821 tensor_2822 tensor_2823 tensor_2824 tensor_2825
BinaryOp         240                      2 1 state_0_2 tensor_2825 tensor_2826 0=1
Split            241                      1 2 tensor_2826 tensor_2827 tensor_2828
MemoryData       242                      0 1 blocks.0.ffn.time_mix_k 0=512 21=0
BinaryOp         243                      2 1 tensor_2827 blocks.0.ffn.time_mix_k tensor_2830 0=2
BinaryOp         244                      2 1 tensor_2822 tensor_2830 tensor_2831 0=0
MemoryData       245                      0 1 blocks.0.ffn.time_mix_r 0=512 21=0
BinaryOp         246                      2 1 tensor_2828 blocks.0.ffn.time_mix_r tensor_2833 0=2
BinaryOp         247                      2 1 tensor_2823 tensor_2833 tensor_2834 0=0
Reshape          248                      1 1 tensor_2834 tensor_2835 0=0 1=1
Gemm             249                      1 1 tensor_2835 tensor_2837 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          250                      1 1 tensor_2837 tensor_2838 0=-1
Sigmoid          251                      1 1 tensor_2838 tensor_2839
Reshape          252                      1 1 tensor_2831 tensor_2840 0=0 1=1
Gemm             253                      1 1 tensor_2840 tensor_2842 4=0 5=1 6=1 7=0 8=1792 9=512 10=-1
Reshape          254                      1 1 tensor_2842 tensor_2843 0=-1
ReLU             255                      1 1 tensor_2843 tensor_2844
BinaryOp         256                      2 1 tensor_2844 tensor_2844 tensor_2845 0=2
Reshape          257                      1 1 tensor_2845 tensor_2846 0=0 1=1
Gemm             258                      1 1 tensor_2846 tensor_2848 4=0 5=1 6=1 7=0 8=512 9=1792 10=-1
Reshape          259                      1 1 tensor_2848 tensor_2849 0=-1
BinaryOp         260                      2 1 tensor_2839 tensor_2849 tensor_2850 0=2
BinaryOp         261                      2 1 tensor_2820 tensor_2850 tensor_2851 0=0
Split            262                      1 1 tensor_2824 output_state_0_2
Split            263                      1 2 tensor_2851 tensor_2853 tensor_2854
LayerNorm        264                      1 1 tensor_2853 tensor_2855 0=512 1=1.000000e-05 2=1
Split            265                      1 3 tensor_2855 tensor_2856 tensor_2857 tensor_2858
Split            266                      1 6 tensor_2856 tensor_2859 tensor_2860 tensor_2861 tensor_2862 tensor_2863 tensor_2864
BinaryOp         267                      2 1 state_1_0 tensor_2857 tensor_2865 0=1
Split            268                      1 6 tensor_2865 tensor_2866 tensor_2867 tensor_2868 tensor_2869 tensor_2870 tensor_2871
MemoryData       269                      0 1 blocks.1.att.time_mix_x 0=512 21=0
BinaryOp         270                      2 1 tensor_2866 blocks.1.att.time_mix_x tensor_2873 0=2
BinaryOp         271                      2 1 tensor_2858 tensor_2873 tensor_2874 0=0
MemoryData       272                      0 1 blocks.1.att.time_mix_w1 0=160 1=512 21=0
MatMul           273                      2 1 tensor_2874 blocks.1.att.time_mix_w1 tensor_2876 0=0
TanH             274                      1 1 tensor_2876 tensor_2877
Reshape          275                      1 1 tensor_2877 tensor_2878 0=32 1=1 2=5
MemoryData       276                      0 1 blocks.1.att.time_mix_w2 0=512 1=32 2=5 21=0
MatMul           277                      2 1 tensor_2878 blocks.1.att.time_mix_w2 tensor_2880 0=0
Reshape          278                      1 1 tensor_2880 tensor_2881 0=512 1=5
Slice            279                      1 5 tensor_2881 tensor_2882 tensor_2883 tensor_2884 tensor_2885 tensor_2886 -23300=5,-233,-233,-233,-233,-233 1=0
Reshape          280                      1 1 tensor_2882 tensor_2887 0=512
MemoryData       281                      0 1 blocks.1.att.time_mix_w 0=512 21=0
BinaryOp         282                      2 1 blocks.1.att.time_mix_w tensor_2887 tensor_2889 0=0
BinaryOp         283                      2 1 tensor_2867 tensor_2889 tensor_2890 0=2
BinaryOp         284                      2 1 tensor_2859 tensor_2890 tensor_2891 0=0
Reshape          285                      1 1 tensor_2883 tensor_2892 0=512
MemoryData       286                      0 1 blocks.1.att.time_mix_k 0=512 21=0
BinaryOp         287                      2 1 blocks.1.att.time_mix_k tensor_2892 tensor_2894 0=0
BinaryOp         288                      2 1 tensor_2868 tensor_2894 tensor_2895 0=2
BinaryOp         289                      2 1 tensor_2860 tensor_2895 tensor_2896 0=0
Reshape          290                      1 1 tensor_2884 tensor_2897 0=512
MemoryData       291                      0 1 blocks.1.att.time_mix_v 0=512 21=0
BinaryOp         292                      2 1 blocks.1.att.time_mix_v tensor_2897 tensor_2899 0=0
BinaryOp         293                      2 1 tensor_2869 tensor_2899 tensor_2900 0=2
BinaryOp         294                      2 1 tensor_2861 tensor_2900 tensor_2901 0=0
Reshape          295                      1 1 tensor_2885 tensor_2902 0=512
MemoryData       296                      0 1 blocks.1.att.time_mix_r 0=512 21=0
BinaryOp         297                      2 1 blocks.1.att.time_mix_r tensor_2902 tensor_2904 0=0
BinaryOp         298                      2 1 tensor_2870 tensor_2904 tensor_2905 0=2
BinaryOp         299                      2 1 tensor_2862 tensor_2905 tensor_2906 0=0
Reshape          300                      1 1 tensor_2886 tensor_2907 0=512
MemoryData       301                      0 1 blocks.1.att.time_mix_g 0=512 21=0
BinaryOp         302                      2 1 blocks.1.att.time_mix_g tensor_2907 tensor_2909 0=0
BinaryOp         303                      2 1 tensor_2871 tensor_2909 tensor_2910 0=2
BinaryOp         304                      2 1 tensor_2863 tensor_2910 tensor_2911 0=0
Reshape          305                      1 1 tensor_2891 tensor_2912 0=0 1=1
Gemm             306                      1 1 tensor_2912 tensor_2914 4=0 5=1 6=1 7=0 8=64 9=512 10=-1
Reshape          307                      1 1 tensor_2914 tensor_2915 0=-1
TanH             308                      1 1 tensor_2915 tensor_2916
Reshape          309                      1 1 tensor_2916 tensor_2917 0=0 1=1
Gemm             310                      1 1 tensor_2917 tensor_2919 4=0 5=1 6=1 7=0 8=512 9=64 10=-1
Reshape          311                      1 1 tensor_2919 tensor_2920 0=-1
Reshape          312                      1 1 tensor_2920 tensor_2921 0=1 1=64 2=8
MemoryData       313                      0 1 blocks.1.att.time_decay 0=1 1=64 2=8 21=0
BinaryOp         314                      2 1 blocks.1.att.time_decay tensor_2921 tensor_2923 0=0
Exp              315                      1 1 tensor_2923 tensor_2924
BinaryOp         316                      1 1 tensor_2924 tensor_2925 0=7 1=1 2=0.000000e+00
Exp              317                      1 1 tensor_2925 tensor_2926
Reshape          318                      1 1 tensor_2906 tensor_2927 0=0 1=1
Gemm             319                      1 1 tensor_2927 tensor_2929 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          320                      1 1 tensor_2929 tensor_2930 0=-1
Reshape          321                      1 1 tensor_2930 tensor_2931 0=64 1=1 2=8
Reshape          322                      1 1 tensor_2896 tensor_2932 0=0 1=1
Gemm             323                      1 1 tensor_2932 tensor_2934 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          324                      1 1 tensor_2934 tensor_2935 0=-1
Reshape          325                      1 1 tensor_2935 tensor_2936 0=1 1=64 2=8
Reshape          326                      1 1 tensor_2901 tensor_2937 0=0 1=1
Gemm             327                      1 1 tensor_2937 tensor_2939 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          328                      1 1 tensor_2939 tensor_2940 0=-1
Reshape          329                      1 1 tensor_2940 tensor_2941 0=64 1=1 2=8
Reshape          330                      1 1 tensor_2911 tensor_2942 0=0 1=1
Gemm             331                      1 1 tensor_2942 tensor_2944 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          332                      1 1 tensor_2944 tensor_2945 0=-1
Swish            333                      1 1 tensor_2945 tensor_2946
MatMul           334                      2 1 tensor_2936 tensor_2941 tensor_2947 0=0
Split            335                      1 2 tensor_2947 tensor_2948 tensor_2949
Split            336                      1 2 state_1_1 tensor_2950 tensor_2951
MemoryData       337                      0 1 blocks.1.att.time_first 0=1 1=64 2=8 21=0
BinaryOp         338                      2 1 tensor_2948 blocks.1.att.time_first tensor_2953 0=2
BinaryOp         339                      2 1 tensor_2953 tensor_2950 tensor_2954 0=0
MatMul           340                      2 1 tensor_2931 tensor_2954 tensor_2955 0=0
BinaryOp         341                      2 1 tensor_2951 tensor_2926 tensor_2956 0=2
BinaryOp         342                      2 1 tensor_2949 tensor_2956 tensor_2957 0=0
Reshape          343                      1 1 tensor_2955 tensor_2958 0=512
GroupNorm        344                      1 1 tensor_2958 tensor_2959 0=8 1=512 2=1.000000e-05 3=1
Reshape          345                      1 1 tensor_2959 tensor_2960 0=512
BinaryOp         346                      2 1 tensor_2960 tensor_2946 tensor_2961 0=2
Reshape          347                      1 1 tensor_2961 tensor_2962 0=0 1=1
Gemm             348                      1 1 tensor_2962 tensor_2964 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          349                      1 1 tensor_2964 tensor_2965 0=-1
BinaryOp         350                      2 1 tensor_2854 tensor_2965 tensor_2966 0=0
Split            351                      1 1 tensor_2864 output_state_1_0
Split            352                      1 1 tensor_2957 output_state_1_1
Split            353                      1 2 tensor_2966 tensor_2969 tensor_2970
LayerNorm        354                      1 1 tensor_2969 tensor_2971 0=512 1=1.000000e-05 2=1
Split            355                      1 4 tensor_2971 tensor_2972 tensor_2973 tensor_2974 tensor_2975
BinaryOp         356                      2 1 state_1_2 tensor_2975 tensor_2976 0=1
Split            357                      1 2 tensor_2976 tensor_2977 tensor_2978
MemoryData       358                      0 1 blocks.1.ffn.time_mix_k 0=512 21=0
BinaryOp         359                      2 1 tensor_2977 blocks.1.ffn.time_mix_k tensor_2980 0=2
BinaryOp         360                      2 1 tensor_2972 tensor_2980 tensor_2981 0=0
MemoryData       361                      0 1 blocks.1.ffn.time_mix_r 0=512 21=0
BinaryOp         362                      2 1 tensor_2978 blocks.1.ffn.time_mix_r tensor_2983 0=2
BinaryOp         363                      2 1 tensor_2973 tensor_2983 tensor_2984 0=0
Reshape          364                      1 1 tensor_2984 tensor_2985 0=0 1=1
Gemm             365                      1 1 tensor_2985 tensor_2987 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          366                      1 1 tensor_2987 tensor_2988 0=-1
Sigmoid          367                      1 1 tensor_2988 tensor_2989
Reshape          368                      1 1 tensor_2981 tensor_2990 0=0 1=1
Gemm             369                      1 1 tensor_2990 tensor_2992 4=0 5=1 6=1 7=0 8=1792 9=512 10=-1
Reshape          370                      1 1 tensor_2992 tensor_2993 0=-1
ReLU             371                      1 1 tensor_2993 tensor_2994
BinaryOp         372                      2 1 tensor_2994 tensor_2994 tensor_2995 0=2
Reshape          373                      1 1 tensor_2995 tensor_2996 0=0 1=1
Gemm             374                      1 1 tensor_2996 tensor_2998 4=0 5=1 6=1 7=0 8=512 9=1792 10=-1
Reshape          375                      1 1 tensor_2998 tensor_2999 0=-1
BinaryOp         376                      2 1 tensor_2989 tensor_2999 tensor_3000 0=2
BinaryOp         377                      2 1 tensor_2970 tensor_3000 tensor_3001 0=0
Split            378                      1 1 tensor_2974 output_state_1_2
Split            379                      1 2 tensor_3001 tensor_3003 tensor_3004
LayerNorm        380                      1 1 tensor_3003 tensor_3005 0=512 1=1.000000e-05 2=1
Split            381                      1 3 tensor_3005 tensor_3006 tensor_3007 tensor_3008
Split            382                      1 6 tensor_3006 tensor_3009 tensor_3010 tensor_3011 tensor_3012 tensor_3013 tensor_3014
BinaryOp         383                      2 1 state_2_0 tensor_3007 tensor_3015 0=1
Split            384                      1 6 tensor_3015 tensor_3016 tensor_3017 tensor_3018 tensor_3019 tensor_3020 tensor_3021
MemoryData       385                      0 1 blocks.2.att.time_mix_x 0=512 21=0
BinaryOp         386                      2 1 tensor_3016 blocks.2.att.time_mix_x tensor_3023 0=2
BinaryOp         387                      2 1 tensor_3008 tensor_3023 tensor_3024 0=0
MemoryData       388                      0 1 blocks.2.att.time_mix_w1 0=160 1=512 21=0
MatMul           389                      2 1 tensor_3024 blocks.2.att.time_mix_w1 tensor_3026 0=0
TanH             390                      1 1 tensor_3026 tensor_3027
Reshape          391                      1 1 tensor_3027 tensor_3028 0=32 1=1 2=5
MemoryData       392                      0 1 blocks.2.att.time_mix_w2 0=512 1=32 2=5 21=0
MatMul           393                      2 1 tensor_3028 blocks.2.att.time_mix_w2 tensor_3030 0=0
Reshape          394                      1 1 tensor_3030 tensor_3031 0=512 1=5
Slice            395                      1 5 tensor_3031 tensor_3032 tensor_3033 tensor_3034 tensor_3035 tensor_3036 -23300=5,-233,-233,-233,-233,-233 1=0
Reshape          396                      1 1 tensor_3032 tensor_3037 0=512
MemoryData       397                      0 1 blocks.2.att.time_mix_w 0=512 21=0
BinaryOp         398                      2 1 blocks.2.att.time_mix_w tensor_3037 tensor_3039 0=0
BinaryOp         399                      2 1 tensor_3017 tensor_3039 tensor_3040 0=2
BinaryOp         400                      2 1 tensor_3009 tensor_3040 tensor_3041 0=0
Reshape          401                      1 1 tensor_3033 tensor_3042 0=512
MemoryData       402                      0 1 blocks.2.att.time_mix_k 0=512 21=0
BinaryOp         403                      2 1 blocks.2.att.time_mix_k tensor_3042 tensor_3044 0=0
BinaryOp         404                      2 1 tensor_3018 tensor_3044 tensor_3045 0=2
BinaryOp         405                      2 1 tensor_3010 tensor_3045 tensor_3046 0=0
Reshape          406                      1 1 tensor_3034 tensor_3047 0=512
MemoryData       407                      0 1 blocks.2.att.time_mix_v 0=512 21=0
BinaryOp         408                      2 1 blocks.2.att.time_mix_v tensor_3047 tensor_3049 0=0
BinaryOp         409                      2 1 tensor_3019 tensor_3049 tensor_3050 0=2
BinaryOp         410                      2 1 tensor_3011 tensor_3050 tensor_3051 0=0
Reshape          411                      1 1 tensor_3035 tensor_3052 0=512
MemoryData       412                      0 1 blocks.2.att.time_mix_r 0=512 21=0
BinaryOp         413                      2 1 blocks.2.att.time_mix_r tensor_3052 tensor_3054 0=0
BinaryOp         414                      2 1 tensor_3020 tensor_3054 tensor_3055 0=2
BinaryOp         415                      2 1 tensor_3012 tensor_3055 tensor_3056 0=0
Reshape          416                      1 1 tensor_3036 tensor_3057 0=512
MemoryData       417                      0 1 blocks.2.att.time_mix_g 0=512 21=0
BinaryOp         418                      2 1 blocks.2.att.time_mix_g tensor_3057 tensor_3059 0=0
BinaryOp         419                      2 1 tensor_3021 tensor_3059 tensor_3060 0=2
BinaryOp         420                      2 1 tensor_3013 tensor_3060 tensor_3061 0=0
Reshape          421                      1 1 tensor_3041 tensor_3062 0=0 1=1
Gemm             422                      1 1 tensor_3062 tensor_3064 4=0 5=1 6=1 7=0 8=64 9=512 10=-1
Reshape          423                      1 1 tensor_3064 tensor_3065 0=-1
TanH             424                      1 1 tensor_3065 tensor_3066
Reshape          425                      1 1 tensor_3066 tensor_3067 0=0 1=1
Gemm             426                      1 1 tensor_3067 tensor_3069 4=0 5=1 6=1 7=0 8=512 9=64 10=-1
Reshape          427                      1 1 tensor_3069 tensor_3070 0=-1
Reshape          428                      1 1 tensor_3070 tensor_3071 0=1 1=64 2=8
MemoryData       429                      0 1 blocks.2.att.time_decay 0=1 1=64 2=8 21=0
BinaryOp         430                      2 1 blocks.2.att.time_decay tensor_3071 tensor_3073 0=0
Exp              431                      1 1 tensor_3073 tensor_3074
BinaryOp         432                      1 1 tensor_3074 tensor_3075 0=7 1=1 2=0.000000e+00
Exp              433                      1 1 tensor_3075 tensor_3076
Reshape          434                      1 1 tensor_3056 tensor_3077 0=0 1=1
Gemm             435                      1 1 tensor_3077 tensor_3079 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          436                      1 1 tensor_3079 tensor_3080 0=-1
Reshape          437                      1 1 tensor_3080 tensor_3081 0=64 1=1 2=8
Reshape          438                      1 1 tensor_3046 tensor_3082 0=0 1=1
Gemm             439                      1 1 tensor_3082 tensor_3084 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          440                      1 1 tensor_3084 tensor_3085 0=-1
Reshape          441                      1 1 tensor_3085 tensor_3086 0=1 1=64 2=8
Reshape          442                      1 1 tensor_3051 tensor_3087 0=0 1=1
Gemm             443                      1 1 tensor_3087 tensor_3089 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          444                      1 1 tensor_3089 tensor_3090 0=-1
Reshape          445                      1 1 tensor_3090 tensor_3091 0=64 1=1 2=8
Reshape          446                      1 1 tensor_3061 tensor_3092 0=0 1=1
Gemm             447                      1 1 tensor_3092 tensor_3094 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          448                      1 1 tensor_3094 tensor_3095 0=-1
Swish            449                      1 1 tensor_3095 tensor_3096
MatMul           450                      2 1 tensor_3086 tensor_3091 tensor_3097 0=0
Split            451                      1 2 tensor_3097 tensor_3098 tensor_3099
Split            452                      1 2 state_2_1 tensor_3100 tensor_3101
MemoryData       453                      0 1 blocks.2.att.time_first 0=1 1=64 2=8 21=0
BinaryOp         454                      2 1 tensor_3098 blocks.2.att.time_first tensor_3103 0=2
BinaryOp         455                      2 1 tensor_3103 tensor_3100 tensor_3104 0=0
MatMul           456                      2 1 tensor_3081 tensor_3104 tensor_3105 0=0
BinaryOp         457                      2 1 tensor_3101 tensor_3076 tensor_3106 0=2
BinaryOp         458                      2 1 tensor_3099 tensor_3106 tensor_3107 0=0
Reshape          459                      1 1 tensor_3105 tensor_3108 0=512
GroupNorm        460                      1 1 tensor_3108 tensor_3109 0=8 1=512 2=1.000000e-05 3=1
Reshape          461                      1 1 tensor_3109 tensor_3110 0=512
BinaryOp         462                      2 1 tensor_3110 tensor_3096 tensor_3111 0=2
Reshape          463                      1 1 tensor_3111 tensor_3112 0=0 1=1
Gemm             464                      1 1 tensor_3112 tensor_3114 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          465                      1 1 tensor_3114 tensor_3115 0=-1
BinaryOp         466                      2 1 tensor_3004 tensor_3115 tensor_3116 0=0
Split            467                      1 1 tensor_3014 output_state_2_0
Split            468                      1 1 tensor_3107 output_state_2_1
Split            469                      1 2 tensor_3116 tensor_3119 tensor_3120
LayerNorm        470                      1 1 tensor_3119 tensor_3121 0=512 1=1.000000e-05 2=1
Split            471                      1 4 tensor_3121 tensor_3122 tensor_3123 tensor_3124 tensor_3125
BinaryOp         472                      2 1 state_2_2 tensor_3125 tensor_3126 0=1
Split            473                      1 2 tensor_3126 tensor_3127 tensor_3128
MemoryData       474                      0 1 blocks.2.ffn.time_mix_k 0=512 21=0
BinaryOp         475                      2 1 tensor_3127 blocks.2.ffn.time_mix_k tensor_3130 0=2
BinaryOp         476                      2 1 tensor_3122 tensor_3130 tensor_3131 0=0
MemoryData       477                      0 1 blocks.2.ffn.time_mix_r 0=512 21=0
BinaryOp         478                      2 1 tensor_3128 blocks.2.ffn.time_mix_r tensor_3133 0=2
BinaryOp         479                      2 1 tensor_3123 tensor_3133 tensor_3134 0=0
Reshape          480                      1 1 tensor_3134 tensor_3135 0=0 1=1
Gemm             481                      1 1 tensor_3135 tensor_3137 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          482                      1 1 tensor_3137 tensor_3138 0=-1
Sigmoid          483                      1 1 tensor_3138 tensor_3139
Reshape          484                      1 1 tensor_3131 tensor_3140 0=0 1=1
Gemm             485                      1 1 tensor_3140 tensor_3142 4=0 5=1 6=1 7=0 8=1792 9=512 10=-1
Reshape          486                      1 1 tensor_3142 tensor_3143 0=-1
ReLU             487                      1 1 tensor_3143 tensor_3144
BinaryOp         488                      2 1 tensor_3144 tensor_3144 tensor_3145 0=2
Reshape          489                      1 1 tensor_3145 tensor_3146 0=0 1=1
Gemm             490                      1 1 tensor_3146 tensor_3148 4=0 5=1 6=1 7=0 8=512 9=1792 10=-1
Reshape          491                      1 1 tensor_3148 tensor_3149 0=-1
BinaryOp         492                      2 1 tensor_3139 tensor_3149 tensor_3150 0=2
BinaryOp         493                      2 1 tensor_3120 tensor_3150 tensor_3151 0=0
Split            494                      1 1 tensor_3124 output_state_2_2
Split            495                      1 2 tensor_3151 tensor_3153 tensor_3154
LayerNorm        496                      1 1 tensor_3153 tensor_3155 0=512 1=1.000000e-05 2=1
Split            497                      1 3 tensor_3155 tensor_3156 tensor_3157 tensor_3158
Split            498                      1 6 tensor_3156 tensor_3159 tensor_3160 tensor_3161 tensor_3162 tensor_3163 tensor_3164
BinaryOp         499                      2 1 state_3_0 tensor_3157 tensor_3165 0=1
Split            500                      1 6 tensor_3165 tensor_3166 tensor_3167 tensor_3168 tensor_3169 tensor_3170 tensor_3171
MemoryData       501                      0 1 blocks.3.att.time_mix_x 0=512 21=0
BinaryOp         502                      2 1 tensor_3166 blocks.3.att.time_mix_x tensor_3173 0=2
BinaryOp         503                      2 1 tensor_3158 tensor_3173 tensor_3174 0=0
MemoryData       504                      0 1 blocks.3.att.time_mix_w1 0=160 1=512 21=0
MatMul           505                      2 1 tensor_3174 blocks.3.att.time_mix_w1 tensor_3176 0=0
TanH             506                      1 1 tensor_3176 tensor_3177
Reshape          507                      1 1 tensor_3177 tensor_3178 0=32 1=1 2=5
MemoryData       508                      0 1 blocks.3.att.time_mix_w2 0=512 1=32 2=5 21=0
MatMul           509                      2 1 tensor_3178 blocks.3.att.time_mix_w2 tensor_3180 0=0
Reshape          510                      1 1 tensor_3180 tensor_3181 0=512 1=5
Slice            511                      1 5 tensor_3181 tensor_3182 tensor_3183 tensor_3184 tensor_3185 tensor_3186 -23300=5,-233,-233,-233,-233,-233 1=0
Reshape          512                      1 1 tensor_3182 tensor_3187 0=512
MemoryData       513                      0 1 blocks.3.att.time_mix_w 0=512 21=0
BinaryOp         514                      2 1 blocks.3.att.time_mix_w tensor_3187 tensor_3189 0=0
BinaryOp         515                      2 1 tensor_3167 tensor_3189 tensor_3190 0=2
BinaryOp         516                      2 1 tensor_3159 tensor_3190 tensor_3191 0=0
Reshape          517                      1 1 tensor_3183 tensor_3192 0=512
MemoryData       518                      0 1 blocks.3.att.time_mix_k 0=512 21=0
BinaryOp         519                      2 1 blocks.3.att.time_mix_k tensor_3192 tensor_3194 0=0
BinaryOp         520                      2 1 tensor_3168 tensor_3194 tensor_3195 0=2
BinaryOp         521                      2 1 tensor_3160 tensor_3195 tensor_3196 0=0
Reshape          522                      1 1 tensor_3184 tensor_3197 0=512
MemoryData       523                      0 1 blocks.3.att.time_mix_v 0=512 21=0
BinaryOp         524                      2 1 blocks.3.att.time_mix_v tensor_3197 tensor_3199 0=0
BinaryOp         525                      2 1 tensor_3169 tensor_3199 tensor_3200 0=2
BinaryOp         526                      2 1 tensor_3161 tensor_3200 tensor_3201 0=0
Reshape          527                      1 1 tensor_3185 tensor_3202 0=512
MemoryData       528                      0 1 blocks.3.att.time_mix_r 0=512 21=0
BinaryOp         529                      2 1 blocks.3.att.time_mix_r tensor_3202 tensor_3204 0=0
BinaryOp         530                      2 1 tensor_3170 tensor_3204 tensor_3205 0=2
BinaryOp         531                      2 1 tensor_3162 tensor_3205 tensor_3206 0=0
Reshape          532                      1 1 tensor_3186 tensor_3207 0=512
MemoryData       533                      0 1 blocks.3.att.time_mix_g 0=512 21=0
BinaryOp         534                      2 1 blocks.3.att.time_mix_g tensor_3207 tensor_3209 0=0
BinaryOp         535                      2 1 tensor_3171 tensor_3209 tensor_3210 0=2
BinaryOp         536                      2 1 tensor_3163 tensor_3210 tensor_3211 0=0
Reshape          537                      1 1 tensor_3191 tensor_3212 0=0 1=1
Gemm             538                      1 1 tensor_3212 tensor_3214 4=0 5=1 6=1 7=0 8=64 9=512 10=-1
Reshape          539                      1 1 tensor_3214 tensor_3215 0=-1
TanH             540                      1 1 tensor_3215 tensor_3216
Reshape          541                      1 1 tensor_3216 tensor_3217 0=0 1=1
Gemm             542                      1 1 tensor_3217 tensor_3219 4=0 5=1 6=1 7=0 8=512 9=64 10=-1
Reshape          543                      1 1 tensor_3219 tensor_3220 0=-1
Reshape          544                      1 1 tensor_3220 tensor_3221 0=1 1=64 2=8
MemoryData       545                      0 1 blocks.3.att.time_decay 0=1 1=64 2=8 21=0
BinaryOp         546                      2 1 blocks.3.att.time_decay tensor_3221 tensor_3223 0=0
Exp              547                      1 1 tensor_3223 tensor_3224
BinaryOp         548                      1 1 tensor_3224 tensor_3225 0=7 1=1 2=0.000000e+00
Exp              549                      1 1 tensor_3225 tensor_3226
Reshape          550                      1 1 tensor_3206 tensor_3227 0=0 1=1
Gemm             551                      1 1 tensor_3227 tensor_3229 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          552                      1 1 tensor_3229 tensor_3230 0=-1
Reshape          553                      1 1 tensor_3230 tensor_3231 0=64 1=1 2=8
Reshape          554                      1 1 tensor_3196 tensor_3232 0=0 1=1
Gemm             555                      1 1 tensor_3232 tensor_3234 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          556                      1 1 tensor_3234 tensor_3235 0=-1
Reshape          557                      1 1 tensor_3235 tensor_3236 0=1 1=64 2=8
Reshape          558                      1 1 tensor_3201 tensor_3237 0=0 1=1
Gemm             559                      1 1 tensor_3237 tensor_3239 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          560                      1 1 tensor_3239 tensor_3240 0=-1
Reshape          561                      1 1 tensor_3240 tensor_3241 0=64 1=1 2=8
Reshape          562                      1 1 tensor_3211 tensor_3242 0=0 1=1
Gemm             563                      1 1 tensor_3242 tensor_3244 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          564                      1 1 tensor_3244 tensor_3245 0=-1
Swish            565                      1 1 tensor_3245 tensor_3246
MatMul           566                      2 1 tensor_3236 tensor_3241 tensor_3247 0=0
Split            567                      1 2 tensor_3247 tensor_3248 tensor_3249
Split            568                      1 2 state_3_1 tensor_3250 tensor_3251
MemoryData       569                      0 1 blocks.3.att.time_first 0=1 1=64 2=8 21=0
BinaryOp         570                      2 1 tensor_3248 blocks.3.att.time_first tensor_3253 0=2
BinaryOp         571                      2 1 tensor_3253 tensor_3250 tensor_3254 0=0
MatMul           572                      2 1 tensor_3231 tensor_3254 tensor_3255 0=0
BinaryOp         573                      2 1 tensor_3251 tensor_3226 tensor_3256 0=2
BinaryOp         574                      2 1 tensor_3249 tensor_3256 tensor_3257 0=0
Reshape          575                      1 1 tensor_3255 tensor_3258 0=512
GroupNorm        576                      1 1 tensor_3258 tensor_3259 0=8 1=512 2=1.000000e-05 3=1
Reshape          577                      1 1 tensor_3259 tensor_3260 0=512
BinaryOp         578                      2 1 tensor_3260 tensor_3246 tensor_3261 0=2
Reshape          579                      1 1 tensor_3261 tensor_3262 0=0 1=1
Gemm             580                      1 1 tensor_3262 tensor_3264 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          581                      1 1 tensor_3264 tensor_3265 0=-1
BinaryOp         582                      2 1 tensor_3154 tensor_3265 tensor_3266 0=0
Split            583                      1 1 tensor_3164 output_state_3_0
Split            584                      1 1 tensor_3257 output_state_3_1
Split            585                      1 2 tensor_3266 tensor_3269 tensor_3270
LayerNorm        586                      1 1 tensor_3269 tensor_3271 0=512 1=1.000000e-05 2=1
Split            587                      1 4 tensor_3271 tensor_3272 tensor_3273 tensor_3274 tensor_3275
BinaryOp         588                      2 1 state_3_2 tensor_3275 tensor_3276 0=1
Split            589                      1 2 tensor_3276 tensor_3277 tensor_3278
MemoryData       590                      0 1 blocks.3.ffn.time_mix_k 0=512 21=0
BinaryOp         591                      2 1 tensor_3277 blocks.3.ffn.time_mix_k tensor_3280 0=2
BinaryOp         592                      2 1 tensor_3272 tensor_3280 tensor_3281 0=0
MemoryData       593                      0 1 blocks.3.ffn.time_mix_r 0=512 21=0
BinaryOp         594                      2 1 tensor_3278 blocks.3.ffn.time_mix_r tensor_3283 0=2
BinaryOp         595                      2 1 tensor_3273 tensor_3283 tensor_3284 0=0
Reshape          596                      1 1 tensor_3284 tensor_3285 0=0 1=1
Gemm             597                      1 1 tensor_3285 tensor_3287 4=0 5=1 6=1 7=0 8=512 9=512 10=-1
Reshape          598                      1 1 tensor_3287 tensor_3288 0=-1
Sigmoid          599                      1 1 tensor_3288 tensor_3289
Reshape          600                      1 1 tensor_3281 tensor_3290 0=0 1=1
Gemm             601                      1 1 tensor_3290 tensor_3292 4=0 5=1 6=1 7=0 8=1792 9=512 10=-1
Reshape          602                      1 1 tensor_3292 tensor_3293 0=-1
ReLU             603                      1 1 tensor_3293 tensor_3294
BinaryOp         604                      2 1 tensor_3294 tensor_3294 tensor_3295 0=2
Reshape          605                      1 1 tensor_3295 tensor_3296 0=0 1=1
Gemm             606                      1 1 tensor_3296 tensor_3298 4=0 5=1 6=1 7=0 8=512 9=1792 10=-1
